<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"2a0d39c20307d6c6cb0f1d8bd891ffed919046ebbb45b7bf9205511ee47157ba","plan_job_ref":"Job .github/workflows/_test-tf.yaml #54 at https://github.com/DND-IT/github-workflows/actions/runs/15365445779","plan_out_hash":"ed97a5801559db5d02685d621f229c2e975509f2c86aabf7a7bb05556a0ce8c7","plan_hash":"bfcf22513062c2a99ad04fe97e18ca703fecc9a77b9a35f1e040d901622cbcb1","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #54](https://github.com/DND-IT/github-workflows/actions/runs/15365445779)